----------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\ENS Paris Saclay\Evaluation de Politique\MOOC\Chap 2_DiD\Pratique\DID.log
  log type:  text
 opened on:  20 Mar 2024, 03:40:33

. 
. use "DID.dta", clear
(W1,S01:HH roster    version1.0)

. ed

. 
. desc

Contains data from DID.dta
  obs:         1,199                          W1,S01:HH roster    version1.0
 vars:            11                          30 Jan 2013 05:41
 size:        44,363                          (_dta has notes)
----------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------
cluster         float   %8.0g                 Cluster
sex1994         byte    %8.0g      sexlbl     Indicator if Male
age1994         int     %8.0g                 W4:S1Q6A: Age in Years
electric        byte    %8.0g      yesno      Electricity Available in Community
pipwater        byte    %8.0g      yesno      Running Water Available in Community
distcapital     double  %10.0g                Dist to Reg Capital
primary         float   %9.0g                 Primary Sch Completed
ocohort         float   %9.0g                 Older 30 to 50 Cohort Group in 1994
ycohort         float   %9.0g                 5 to 25 Cohort Group in 1994
treat           float   %9.0g                 
ycohortxtreat   float   %9.0g                 (5-25) Cohort in 94 X School Construction
----------------------------------------------------------------------------------------------------------------
Sorted by: cluster

. sum age1994

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     age1994 |      1,199    24.57631    9.625924         15         50

. tab sex

  Indicator |
    if Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        656       54.71       54.71
       Male |        543       45.29      100.00
------------+-----------------------------------
      Total |      1,199      100.00

. sum primary

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     primary |      1,199    .6997498     .458558          0          1

. tab treat, sum(age)

            |  Summary of W4:S1Q6A: Age in Years
      treat |        Mean   Std. Dev.       Freq.
------------+------------------------------------
          0 |   24.679958   9.7042066         953
          1 |   24.174797    9.324859         246
------------+------------------------------------
      Total |   24.576314   9.6259235       1,199

. tab treat, sum(sex)

            |    Summary of Indicator if Male
      treat |        Mean   Std. Dev.       Freq.
------------+------------------------------------
          0 |   .44281217    .4969796         953
          1 |   .49186992   .50095313         246
------------+------------------------------------
      Total |    .4528774   .49798222       1,199

. tab treat, sum(primary)

            |  Summary of Primary Sch Completed
      treat |        Mean   Std. Dev.       Freq.
------------+------------------------------------
          0 |   .67890871   .46714094         953
          1 |    .7804878   .41476003         246
------------+------------------------------------
      Total |   .69974979   .45855795       1,199

. ttest age, by(treat)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     953    24.67996    .3143501    9.704207    24.06306    25.29686
       1 |     246     24.1748    .5945313    9.324859    23.00375    25.34584
---------+--------------------------------------------------------------------
combined |   1,199    24.57631    .2779923    9.625924    24.03091    25.12172
---------+--------------------------------------------------------------------
    diff |            .5051613    .6885281                -.845695    1.856018
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.7337
Ho: diff = 0                                     degrees of freedom =     1197

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7684         Pr(|T| > |t|) = 0.4633          Pr(T > t) = 0.2316

. ttest sex, by(treat)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     953    .4428122    .0160987    .4969796     .411219    .4744053
       1 |     246    .4918699    .0319396    .5009531    .4289587    .5547812
---------+--------------------------------------------------------------------
combined |   1,199    .4528774    .0143815    .4979822    .4246617    .4810931
---------+--------------------------------------------------------------------
    diff |           -.0490577    .0355997               -.1189025     .020787
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.3780
Ho: diff = 0                                     degrees of freedom =     1197

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0842         Pr(|T| > |t|) = 0.1684          Pr(T > t) = 0.9158

. ttest primary, by(treat)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     953    .6789087    .0151322    .4671409    .6492124     .708605
       1 |     246    .7804878    .0264441      .41476     .728401    .8325747
---------+--------------------------------------------------------------------
combined |   1,199    .6997498    .0132429     .458558    .6737678    .7257317
---------+--------------------------------------------------------------------
    diff |           -.1015791    .0326757               -.1656871   -.0374711
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -3.1087
Ho: diff = 0                                     degrees of freedom =     1197

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0010         Pr(|T| > |t|) = 0.0019          Pr(T > t) = 0.9990

. 
. codebook cluster

----------------------------------------------------------------------------------------------------------------
cluster                                                                                                  Cluster
----------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,51]                       units:  1
         unique values:  51                       missing .:  0/1,199

                  mean:   26.2819
              std. dev:   14.5904

           percentiles:        10%       25%       50%       75%       90%
                                 6        13        26        39        47

. preserve

. collapse (mean)  sex1994 age1994 primary electric pipwater distcapital treat, by(cluster)

. ttest electric, by(treat)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |      41    .2682927    .0700556     .448575    .1267049    .4098804
       1 |      10          .3    .1527525    .4830459   -.0455502    .6455502
---------+--------------------------------------------------------------------
combined |      51    .2745098    .0631117    .4507075    .1477463    .4012733
---------+--------------------------------------------------------------------
    diff |           -.0317073      .16051               -.3542642    .2908496
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.1975
Ho: diff = 0                                     degrees of freedom =       49

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.4221         Pr(|T| > |t|) = 0.8442          Pr(T > t) = 0.5779

. ttest pipwater, by(treat)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |      41    .2195122    .0654459    .4190582    .0872411    .3517833
       1 |      10          .2    .1333333     .421637    -.101621     .501621
---------+--------------------------------------------------------------------
combined |      51    .2156863    .0581663    .4153902    .0988559    .3325167
---------+--------------------------------------------------------------------
    diff |            .0195122    .1479651               -.2778348    .3168592
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.1319
Ho: diff = 0                                     degrees of freedom =       49

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.5522         Pr(|T| > |t|) = 0.8956          Pr(T > t) = 0.4478

. ttest distcapital, by(treat)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |      41    69.88732    11.73162    75.11899    46.17684     93.5978
       1 |      10      44.397    9.189541    29.05988    23.60881    65.18519
---------+--------------------------------------------------------------------
combined |      51    64.88922    9.671837    69.07073    45.46276    84.31567
---------+--------------------------------------------------------------------
    diff |            25.49032    24.33696               -23.41663    74.39726
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.0474
Ho: diff = 0                                     degrees of freedom =       49

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8500         Pr(|T| > |t|) = 0.3001          Pr(T > t) = 0.1500

. ttest sex1994, by(treat)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |      41    .4517683     .016528     .105831    .4183639    .4851727
       1 |      10    .5013243    .0291644    .0922261    .4353497    .5672988
---------+--------------------------------------------------------------------
combined |      51    .4614851      .01461    .1043362    .4321401    .4908301
---------+--------------------------------------------------------------------
    diff |            -.049556    .0364916               -.1228885    .0237765
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.3580
Ho: diff = 0                                     degrees of freedom =       49

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0903         Pr(|T| > |t|) = 0.1807          Pr(T > t) = 0.9097

. ttest age1994, by(treat)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |      41    24.63496    .3099533    1.984669    24.00852     25.2614
       1 |      10    24.37697    .7373995    2.331862    22.70886    26.04508
---------+--------------------------------------------------------------------
combined |      51    24.58437    .2849354    2.034845    24.01206    25.15668
---------+--------------------------------------------------------------------
    diff |            .2579868    .7240184               -1.196983    1.712956
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.3563
Ho: diff = 0                                     degrees of freedom =       49

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.6384         Pr(|T| > |t|) = 0.7231          Pr(T > t) = 0.3616

. ttest primary, by(treat)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |      41     .678956    .0263488    .1687146    .6257031    .7322089
       1 |      10    .7785181    .0364123    .1151458    .6961478    .8608885
---------+--------------------------------------------------------------------
combined |      51     .698478     .022903    .1635605    .6524759    .7444801
---------+--------------------------------------------------------------------
    diff |           -.0995621    .0565093               -.2131219    .0139976
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.7619
Ho: diff = 0                                     degrees of freedom =       49

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0422         Pr(|T| > |t|) = 0.0843          Pr(T > t) = 0.9578

. restore

. 
. reg primary treat if ycohort==1

      Source |       SS           df       MS      Number of obs   =       873
-------------+----------------------------------   F(1, 871)       =     11.27
       Model |  1.66951068         1  1.66951068   Prob > F        =    0.0008
    Residual |   129.00632       871  .148112882   R-squared       =    0.0128
-------------+----------------------------------   Adj R-squared   =    0.0116
       Total |   130.67583       872  .149857604   Root MSE        =    .38485

------------------------------------------------------------------------------
     primary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .1074364   .0320003     3.36   0.001     .0446298    .1702431
       _cons |   .7942029   .0146512    54.21   0.000     .7654472    .8229586
------------------------------------------------------------------------------

. reg primary treat sex1994 age1994 electric pipwater distcapital if ycohort==1

      Source |       SS           df       MS      Number of obs   =       873
-------------+----------------------------------   F(6, 866)       =     10.03
       Model |  8.48715732         6  1.41452622   Prob > F        =    0.0000
    Residual |  122.188673       866  .141095466   R-squared       =    0.0649
-------------+----------------------------------   Adj R-squared   =    0.0585
       Total |   130.67583       872  .149857604   Root MSE        =    .37563

------------------------------------------------------------------------------
     primary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .0791924   .0317266     2.50   0.013     .0169223    .1414625
     sex1994 |   .0295212   .0255801     1.15   0.249     -.020685    .0797274
     age1994 |   .0073573   .0042792     1.72   0.086    -.0010415     .015756
    electric |   .0415659   .0387663     1.07   0.284     -.034521    .1176528
    pipwater |  -.0036248   .0412487    -0.09   0.930     -.084584    .0773343
 distcapital |  -.0011708   .0001981    -5.91   0.000    -.0015596    -.000782
       _cons |   .7100537   .0866122     8.20   0.000     .5400593     .880048
------------------------------------------------------------------------------

. reg primary treat if ocohort==1

      Source |       SS           df       MS      Number of obs   =       326
-------------+----------------------------------   F(1, 324)       =      0.58
       Model |  .138201764         1  .138201764   Prob > F        =    0.4467
    Residual |  77.1624117       324  .238155592   R-squared       =    0.0018
-------------+----------------------------------   Adj R-squared   =   -0.0013
       Total |  77.3006135       325  .237848042   Root MSE        =    .48801

------------------------------------------------------------------------------
     primary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .0521456   .0684528     0.76   0.447    -.0825224    .1868136
       _cons |   .3764259   .0300921    12.51   0.000     .3172253    .4356264
------------------------------------------------------------------------------

. reg primary treat sex1994 age1994 electric pipwater distcapital if ocohort==1

      Source |       SS           df       MS      Number of obs   =       326
-------------+----------------------------------   F(6, 319)       =     16.44
       Model |  18.2545607         6  3.04242678   Prob > F        =    0.0000
    Residual |  59.0460528       319  .185097344   R-squared       =    0.2362
-------------+----------------------------------   Adj R-squared   =    0.2218
       Total |  77.3006135       325  .237848042   Root MSE        =    .43023

------------------------------------------------------------------------------
     primary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |  -.0106323   .0613999    -0.17   0.863    -.1314321    .1101675
     sex1994 |   .2948356   .0485461     6.07   0.000     .1993247    .3903466
     age1994 |  -.0264262   .0041678    -6.34   0.000    -.0346261   -.0182263
    electric |   .1137218   .0664824     1.71   0.088    -.0170775    .2445211
    pipwater |  -.0110808   .0709837    -0.16   0.876    -.1507361    .1285745
 distcapital |   -.001103   .0003565    -3.09   0.002    -.0018044   -.0004017
       _cons |   1.349162   .1677637     8.04   0.000     1.019099    1.679225
------------------------------------------------------------------------------

. 
. tab ycohort treat, sum(primary)

    Means, Standard Deviations and Frequencies of Primary Sch Completed

   5 to 25 |
    Cohort |
  Group in |        treat
      1994 |         0          1 |     Total
-----------+----------------------+----------
         0 | .37642586  .42857143 | .38650307
           | .48541255   .4988466 | .48769667
           |       263         63 |       326
-----------+----------------------+----------
         1 |  .7942029  .90163934 | .81672394
           | .40457617  .29861869 | .38711446
           |       690        183 |       873
-----------+----------------------+----------
     Total | .67890871   .7804878 | .69974979
           | .46714094  .41476003 | .45855795
           |       953        246 |      1199

. sum primary if ycohort==1 & treat==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     primary |        183    .9016393    .2986187          0          1

. sum primary if ycohort==1 & treat==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     primary |        690    .7942029    .4045762          0          1

. sum primary if ycohort==0 & treat==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     primary |         63    .4285714    .4988466          0          1

. sum primary if ycohort==0 & treat==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     primary |        263    .3764259    .4854126          0          1

. 
. reg primary treat ycohort ycohortxtreat

      Source |       SS           df       MS      Number of obs   =     1,199
-------------+----------------------------------   F(3, 1195)      =     88.38
       Model |  45.7411934         3  15.2470645   Prob > F        =    0.0000
    Residual |  206.168732     1,195  .172526135   R-squared       =    0.1816
-------------+----------------------------------   Adj R-squared   =    0.1795
       Total |  251.909925     1,198  .210275396   Root MSE        =    .41536

-------------------------------------------------------------------------------
      primary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        treat |   .0521456   .0582624     0.90   0.371    -.0621623    .1664535
      ycohort |    .417777   .0301003    13.88   0.000     .3587216    .4768324
ycohortxtreat |   .0552909   .0677297     0.82   0.414    -.0775914    .1881732
        _cons |   .3764259   .0256124    14.70   0.000     .3261757    .4266761
-------------------------------------------------------------------------------

. reg primary treat ycohort ycohortxtreat sex1994 age1994 electric pipwater distcapital

      Source |       SS           df       MS      Number of obs   =     1,199
-------------+----------------------------------   F(8, 1190)      =     47.69
       Model |  61.1578855         8  7.64473568   Prob > F        =    0.0000
    Residual |  190.752039     1,190  .160295831   R-squared       =    0.2428
-------------+----------------------------------   Adj R-squared   =    0.2377
       Total |  251.909925     1,198  .210275396   Root MSE        =    .40037

-------------------------------------------------------------------------------
      primary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        treat |   .0048366   .0564456     0.09   0.932    -.1059074    .1155807
      ycohort |   .1512526   .0652523     2.32   0.021     .0232303    .2792749
ycohortxtreat |   .0671443   .0653586     1.03   0.304    -.0610867    .1953752
      sex1994 |   .1030762   .0233079     4.42   0.000     .0573471    .1488053
      age1994 |   -.012584    .002946    -4.27   0.000     -.018364    -.006804
     electric |   .0577133   .0342633     1.68   0.092      -.00951    .1249366
     pipwater |   .0014912   .0364787     0.04   0.967    -.0700785    .0730609
  distcapital |   -.001167   .0001777    -6.57   0.000    -.0015156   -.0008183
        _cons |   .9031959   .1192442     7.57   0.000     .6692436    1.137148
-------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  D:\ENS Paris Saclay\Evaluation de Politique\MOOC\Chap 2_DiD\Pratique\DID.log
  log type:  text
 closed on:  20 Mar 2024, 03:40:33
----------------------------------------------------------------------------------------------------------------
